# WattsPerFoot Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..WattsPerFoot Property
UnitTypeId Class See Also
---
Watts per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WattsPerFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WattsPerFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WattsPerFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace